#Дано целое число. Если оно является положительным, то прибавить к нему 20, в
#противном случае вычесть из него 5.
a = int(input("Введите целое число"))
if a > 0:
  b = a + 20
  print(b)
else:
 k = a - 5
print(k)
